# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [21]:
s1 = pd.Series(np.random.randint(1,5,100))
s2 = pd.Series(np.random.randint(1,4,100))
s3 = pd.Series(np.random.randint(10000,30000,100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [37]:
df = pd.concat([s1,s2,s3],axis=1)
df

    0  1      2
0   1  1  17182
1   4  3  18680
2   4  2  10235
3   3  3  11151
4   4  3  26986
.. .. ..    ...
95  3  2  23008
96  1  3  16582
97  4  2  21940
98  4  1  29058
99  4  3  17817

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [38]:
df.rename(columns={0:'bedrs',1:'bathrs',2:'price_sqr_meter'},inplace=True)
df

    bedrs  bathrs  price_sqr_meter
0       1       1            17182
1       4       3            18680
2       4       2            10235
3       3       3            11151
4       4       3            26986
..    ...     ...              ...
95      3       2            23008
96      1       3            16582
97      4       2            21940
98      4       1            29058
99      4       3            17817

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [49]:
bigcolumn = pd.concat([s1,s2,s3],axis=0)
bigcolumn.to_frame() # series to df

        0
0       1
1       4
2       4
3       3
4       4
..    ...
95  23008
96  16582
97  21940
98  29058
99  17817

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [54]:
print('yes original index (ie pre-merge) is maintained although length is',bigcolumn.count())

yes original index (ie pre-merge) is maintained although length is 300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [45]:
bigcolumn.reset_index(drop=True,inplace=True)
bigcolumn

0          1
1          4
2          4
3          3
4          4
       ...
295    23008
296    16582
297    21940
298    29058
299    17817
Length: 300, dtype: int32